//#include <iostream>
//using namespace std;
//void main() {
//	__int32 arr = 848843586; // (0011 0010 1001 1000
// // 0101 0011 0100 0010)
//	__int32 res = 0;
//	__asm {
//		mov cx, 8 // к≥льк≥сть проход≥в циклу
//		mov eax, 1 // маска
//		start_outer: // початок зовн≥шнього циклу (по словах)
//		mov bx, 4 // к≥льк≥сть проход≥в внутр≥шнього циклу 
//			xor di, di // обнуленн€ л≥чильника одиниць
//			start_inner : // початок внутр≥шного циклу (по б≥тах)
//		mov edx, arr
//			and edx, eax // накладанн€ маски
//			jz go_next // €кщо результат Ч 0
//			inc di // €кщо результат Ч 1, зб≥льшуЇмо л≥чильник
//			go_next :
//		shl eax, 1 // поб≥товий зсув вл≥во на 1 б≥т
//			dec bx // зменшуЇмо л≥чильник проход≥в на 1
//			test bx, bx // перев≥р€Їмо умову завершенн€ циклу
//			jnz start_inner// повторюЇмо цикл, €кщо результат не 0
//			and di, 1 // перев≥рка на парн≥сть
//			jnz end_ // €кщо непарне
//			inc res // €кщо парне, зб≥льшуЇмо л≥чильник 
//			end_ :
//		loop start_outer // зак≥нченн€ зовн≥шнього циклу
//	}
//	cout << res << endl;
//	system("pause");
//}
